# frozen_string_literal: true

group = {
  id: 4,
  title: "វិជ្ជាជីវៈ",
  recommendation: "បុគ្គលដែលជ្រើសរើសមុខរបរ ទៅនឹងវិជ្ជាជីវៈ ភាគច្រើន ជាបុគ្គលពុំមានលទ្ធភាពបន្តសិក្សាដោយសារកត្តាជីវភាព ឬដោយសារមិនចង់រៀន បែរជាសម្រេចចិត្តចាប់យក ជំនាញមួយដែលខ្លួនស្រឡាញ់ និងគិតថាអាចធ្វើបាន។ ជំនាញវិជ្ជាជីវៈនេះ មិនទាមទារឲ្យមានចំណេះដឹងខ្លាំងនោះទេ យ៉ាងហោចណាស់មានចំណេះដឹងមូលដ្ឋានត្រឹមថ្នាក់ទី៩។ ឱកាសការងារ គឺមាននៅតាមហាងនានា និងនៅតាមបណ្តាខេត្ត ឬរាជធានី។"
}

Vocational.create(title: group[:title], description: group[:recommendation])
